{
  "Home": "Home",
  "About": "About",
  "Projects": "Projects",
  "Contact": "Contact",
  "home": {
    "heroHeading": "HEY, I'M FARHAN",
    "heroDescription": "A Full Stack Developer crafting comprehensive web solutions by seamlessly integrating robust Frontend designs with powerful Backends",
    "heroLinkLabel": "Projects",
    "aboutHeading": "About Me",
    "aboutSubHeading": "Here you will find more information about me, what I do, and my current skills mostly in terms of programming and technology",
    "aboutDescriptionHeading": "Get to know me!",
    "aboutDescription": "<p>I'm a Full Stack Web Developer skilled in building complete web applications from start to finish. I develop both the front-end and back-end portions of web applications, working with both client-side and server-side technologies.</p>  <p>On the front-end, I create responsive and intuitive user interfaces using HTML, CSS, JavaScript frameworks like React. I implement features that enhance the user experience and ensure cross-browser compatibility and responsiveness for mobile devices.</p>  <p>On the back-end, I develop server, API and database components for functionality, security and data using NestJS and databases such as MySQL and PostgreSQL. I integrate the front-end elements with the back-end through RESTful APIs.</p>  <p>I'm open to Job opportunities where I can contribute, learn and grow. If you have a good opportunity that matches my skills and experience then don't hesitate to contact me.</p>",
    "aboutLinkLabel": "Contact",
    "aboutSkillsHeading": "My Skills",
    "projectsHeading": "Projects",
    "projectsSubHeading": "Here you will find some of the personal and clients projects that I created with each project containing its own case study",
    "Thriftshop": "Thriftshop",
    "thriftshop-description": "A platform e-commerce thrift shop that allows users to open their own online stores and upload used products to sell. There is a store panel for sellers to manage products. Buyers can view and checkout items from various stores.",
    "Case Study": "Case Study",
    "contactHeading": "Contact",
    "contactSubHeading": "Feel free to Contact me by submitting the form below and I will get back to you as soon as possible",
    "contactFormField1Label": "Name",
    "contactFormField1Placeholder": "Enter your name",
    "contactFormField2Label": "Email",
    "contactFormField2Placeholder": "Enter your email",
    "contactFormField3Label": "Message",
    "contactFormField3Placeholder": "Enter your message",
    "contactFormSubmitButtonLabel": "Send",
    "tabungan-wisata-description": "This project is a dynamic and responsive website for a study tour travel agency, featuring an attractive home page that showcases the advantages of its services. It includes a comprehensive tour list page with filtering options based on price, duration, and other criteria, as well as 'About Us' and 'Terms of Service' pages. Built with a modern and user-friendly design, this website promises an optimal experience on both desktop and mobile devices, leveraging the latest web development technologies for maximum performance and functionality.",
    "tabungan-wisata-admin-description": "This project is a comprehensive admin dashboard for a Travel Agency that allows efficient operational management. Its main features include tour and event management, customer management, transaction processing, analysis and reporting, as well as content management. One of its standout features is the ability to see which admins are online in real-time using WebSocket technology. This dashboard is built with security and scalability in mind, and follows best practices in modern web development.",
    "tabungan-wisata-dashboard-description": "This project is a user dashboard for a travel agency. Its main features include the ability to top up balances through integrated payments with the Midtrans payment gateway for ease and security of transactions, monitor balances and transaction history with an intuitive and responsive interface, as well as a real-time notification system to stay connected with the latest information. In addition, this project utilizes Progressive Web App (PWA) technology."
  },
  "layout": {
    "footerText": "© Copyright 2023. Made by Farhan Aziz"
  },
  "CSProject": {
    "mainDescription": "This page contains the case study of {project} project which includes the Project Overview, Tools Used and Live Links to the official product.",
    "projectLinkLabel": "Project Link",
    "overviewHeading": "Project Overview",
    "toolsHeading": "Tools Used",
    "liveHeading": "See Live",
    "sourceCodeHeading": "Source Code",
    "thriftshop-overview": "<p>Thrift Shop is an e-commerce platform that allows users to create their own online store and sell secondhand items like a thrift shop. Users can register an account, create a store profile, and upload their products.</p>        <p>Main features:</p>              <ul>       <li>User account registration</li>              <li>Store profile creation</li>              <li>Store panel to manage products</li>              <li>Product upload form with description details, photos, category, stock, and price</li>              <li>Product search and filtering system</li>              <li>Shopping cart</li>              <li>The store panel allows sellers to manage their products by adding stock and updating details.</li>              <li>Buyers can browse and search for products from various stores and add them to the shopping cart.</li>       </ul>",
    "tabungan-wisata-dashboard-overview": "<p>This project is a comprehensive user dashboard for a travel agency. The dashboard offers various features designed to enhance the user experience and provide greater control over their travel activities.</p> <p>Key Features:</p> <ul> <li><strong>Integrated Top Up</strong>: Users can easily top up their account balances through integrated payment methods with the Midtrans payment gateway. This provides a smooth and secure experience for financial transactions.</li> <li><strong>Balance and Transaction Management</strong>: The dashboard provides clear visibility into account balances and user transaction history. Users can easily track their expenditures and monitor their balance progress.</li> <li><strong>Real-time Notifications</strong>: By integrating WebSocket technology, this dashboard allows users to receive real-time notifications about their account activities, travel updates, and other important information.</li> <li><strong>Progressive Web App</strong>: The application is built using the Progressive Web App (PWA) concept, allowing it to function like a native app on mobile devices, providing a more responsive and immersive experience.</li> </ul> <p>During the development process of this project, there were several challenges to overcome and valuable lessons learned:</p> <ul> <li><strong>WebSocket Integration</strong>: Implementing WebSocket to support real-time notifications required a deep understanding of two-way communication between the server and client, as well as efficient connection management.</li> <li><strong>Transaction Security</strong>: Ensuring the security of financial transactions was a top priority. Implementing data encryption, payment verification, and proper error handling were learned and applied to maintain the integrity and security of the system.</li> <li><strong>Authentication and Authorization</strong>: Implementing secure authentication and authorization mechanisms was key to protecting user data and preventing unauthorized access. Techniques such as password encryption, session management, and role-based authorization were learned and properly implemented.</li> <li><strong>Data Precision and Accuracy</strong>: In the context of financial transactions and travel management, data accuracy is crucial. Learning about proper data handling, input validation, and error management was done to ensure data integrity.</li> </ul>",
    "tabungan-wisata-admin-overview": "<p>This project is the development of a comprehensive admin dashboard for a travel agency. This dashboard is designed to facilitate efficient and centralized management of various aspects of the travel agency business, including tour and event management, customer management, transaction management, analytics, reporting, and content management. With comprehensive and integrated features, this admin dashboard offers a powerful solution to optimize operations and provide an optimal user experience for the travel agency management.</p>  <p>Points that can be explained:</p>  <ol>   <li><strong>Tour and Event Management</strong>:</li>   <ul>     <li>Features for creating, organizing, and updating details of tours and events offered by the travel agency.</li>     <li>Ability to schedule, price, participant quotas, and other information related to tours and events.</li>   </ul>    <li><strong>Customer Management</strong>:</li>   <ul>     <li>System for managing customer data, including profiles and booking history.</li>   </ul>    <li><strong>Transaction Management</strong>:</li>   <ul>     <li>Centralized management of bookings and ticket or tour package purchases.</li>     <li>Ability to track booking status and process payments.</li>     <li>Integration with third-party payment gateways to facilitate secure transactions.</li>   </ul>    <li><strong>Analysis and Reporting</strong>:</li>   <ul>     <li>Analytical dashboard displaying key business performance metrics in informative data visualizations.</li>     <li>Ability to generate sales, revenue, and other statistics reports.</li>     <li>Feature to export data in various formats for further analysis.</li>   </ul>    <li><strong>Content Management</strong>:</li>   <ul>     <li>Integrated content management system to manage website information and promotional materials for the travel agency.</li>     <li>Ability to create, edit, and publish content dynamically.</li>   </ul>    <li><strong>Role-Based Access Control (RBAC)</strong>:</li>   <ul>     <li>Implementation of strict authorization and access control system based on user roles and permissions.</li>     <li>Ability to define roles with varying levels of access according to organizational needs.</li>     <li>Ensuring data security and privacy by limiting access only to authorized users.</li>   </ul>    <li><strong>Flexible API Endpoints</strong>:</li>   <ul>     <li>Development of API endpoints allowing integration with external systems or third-party applications.</li>     <li>Ability to perform filtering, sorting, and pagination of data through API endpoints.</li>     <li>Comprehensive API documentation to facilitate further development and integration.</li>   </ul> </ol>",
    "tabungan-wisata-overview": "<p>This project is a web designed for the homepage of a study tour travel agency. The website has an attractive and responsive design, providing an optimal user experience across various devices.</p>  <p>The main features of this project include:</p>  <ul>   <li><strong>Interactive Homepage</strong>: A dynamic and responsive homepage, with an appealing layout and essential information about the travel agency company. This page is designed to make a good impression on visitors and encourage them to explore further.   </li>    <li><strong>Tour Listing Page</strong>: This page displays a comprehensive list of tours offered by the travel agency company. Users can easily browse and find tours that match their interests using advanced filtering features such as price, tour duration, location, and more.   </li>    <li><strong>Responsive and Mobile-Friendly</strong>: This project is built with responsive web design principles, ensuring an optimal user experience across various devices including desktops, tablets, and mobile devices.   </li>    <li><strong>High Performance</strong>: The website is designed with performance in mind, ensuring fast loading times.   </li> </ul>"
  }
}
