{
  "layout": {
    "headingNav1Label": "Home",
    "headingNav1Href": "/",
    "headingNav2Label": "About",
    "headingNav2Href": "#about",
    "headingNav3Label": "Projects",
    "headingNav3Href": "#projects",
    "headingNav4Label": "Contact",
    "headingNav4Href": "#contact",

    "footerText": "© Copyright 2023. Made by Farhan Aziz"
  },
  "home": {
    "heroHeading": "HEY, I'M FARHAN",
    "heroDescription": "A Full Stack Developer crafting comprehensive web solutions by seamlessly integrating robust Frontend designs with powerful Backends",
    "heroLinkLabel": "Projects",
    "heroLinkHref": "#projects",

    "aboutHeading": "About Me",
    "aboutSubHeading": "Here you will find more information about me, what I do, and my current skills mostly in terms of programming and technology",
    "aboutDescriptionHeading": "Get to know me!",
    "aboutDescription1": "I'm a Full Stack Web Developer skilled in building complete web applications from start to finish. I develop both the front-end and back-end portions of web applications, working with both client-side and server-side technologies.",
    "aboutDescription2": "On the front-end, I create responsive and intuitive user interfaces using HTML, CSS, JavaScript frameworks like React. I implement features that enhance the user experience and ensure cross-browser compatibility and responsiveness for mobile devices.",
    "aboutDescription3": "On the back-end, I develop server, API and database components for functionality, security and data using Nextjs Server Actions and databases such as MySQL and PostgreSQL. I integrate the front-end elements with the back-end through RESTful APIs.",
    "aboutDescription4": "I'm open to Job opportunities where I can contribute, learn and grow. If you have a good opportunity that matches my skills and experience then don't hesitate to contact me.",
    "aboutLinkLabel": "Contact",
    "aboutLinkHref": "#contact",
    "aboutSkillsHeading": "My Skills",

    "projectsHeading": "Projects",
    "projectsSubHeading": "Here you will find some of the personal and clients projects that I created with each project containing its own case study",
    "projects1ImageSource": "/",
    "projects1Heading": "Thriftshop",
    "projects1Description": "A platform e-commerce thrift shop that allows users to open their own online stores and upload used products to sell. There is a store panel for sellers to manage products. Buyers can view and checkout items from various stores.",
    "projects1CSLink": "/cs/thriftshop",
    "projects1CSLabel": "Case Study",

    "contactHeading": "Contact",
    "contactSubHeading": "Feel free to Contact me by submitting the form below and I will get back to you as soon as possible",
    "contactFormField1Label": "Name",
    "contactFormField1Placeholder": "Enter your name",
    "contactFormField2Label": "Email",
    "contactFormField2Placeholder": "Enter your email",
    "contactFormField3Label": "Message",
    "contactFormField3Placeholder": "Enter your message",
    "contactFormSubmitButtonLabel": "Submit"
  },
  "CSProject": {
    "mainDescription": "This page contains the case study of {project} project which includes the Project Overview, Tools Used and Live Links to the official product.",
    "projectLinkLabel": "Project Link",
    "overviewHeading": "Project Overview",
    "toolsHeading": "Tools Used",
    "backHeading": "Go Back",
    "liveHeading": "See Live",

    "thriftshopLink": "/",
    "thriftshopOverviewDescription": "<p>Dopefolio is an Open-Source project which is a simple and clean multi-page portfolio website template for developers. I created this project for developers to quickly build a good-looking and fast-performing multi-page portfolio without having to code their portfolio from scratch.</p><p>Since the launch of this project, It has received more than 2k stars on Github and it has also got featured on hundreds of sites and CSS-tricks also featured this template as the hottest frontend tool of 2021 in one of their articles which you can find here</p><p>Dopefolio is now being used thousands of developers globally and it has helped many people in landing jobs & opportunities which makes me happy that my creation is helping other people in building their careers.</p><p>It has many other features like Dopefolio&apos;s repo contains a playground link which people can use to test the with different theme colours to find their own preferred primary colour for the template.</p><p>Feel free to check out the Project by visiting the Project Link.</p>",
    "thriftshopToolsCount": "6",
    "thriftshopTools1": "Typescript",
    "thriftshopTools2": "Nextjs",
    "thriftshopTools3": "Supabase",
    "thriftshopTools4": "Shadcn UI",
    "thriftshopTools5": "GithriftshopThub",
    "thriftshopTools6": "Tailwindcss"
  }
}
