{
  "Home": "Beranda",
  "About": "Tentang",
  "Projects": "Proyek",
  "Contact": "Kontak",
  "home": {
    "heroHeading": "HEI, AKU FARHAN",
    "heroDescription": "Pengembang Full Stack yang membuat solusi web komprehensif dengan mengintegrasikan desain Frontend yang kuat dengan Backend yang kuat",
    "heroLinkLabel": "Proyek",
    "aboutHeading": "Tentang saya",
    "aboutSubHeading": "Di sini Anda akan menemukan lebih banyak informasi tentang saya, apa yang saya lakukan, dan keterampilan saya saat ini, sebagian besar dalam hal pemrograman dan teknologi",
    "aboutDescriptionHeading": "Kenali saya!",
    "aboutDescription": "<p>Saya seorang Pengembang Web Full Stack yang ahli dalam membangun aplikasi web lengkap dari awal hingga akhir. \nSaya mengembangkan bagian front-end dan back-end aplikasi web, bekerja dengan teknologi sisi klien dan sisi server.</p> <p>Di front-end, saya membuat antarmuka pengguna yang responsif dan intuitif menggunakan HTML \n, CSS, kerangka kerja JavaScript seperti React. \nSaya menerapkan fitur yang meningkatkan pengalaman pengguna dan memastikan kompatibilitas dan daya tanggap lintas-browser untuk perangkat seluler.</p> <p>Di bagian belakang, saya mengembangkan komponen server, API, dan database untuk fungsionalitas, keamanan, dan data menggunakan NestJS dan \ndatabase seperti MySQL dan PostgreSQL. \nSaya mengintegrasikan elemen front-end dengan back-end melalui RESTful API.</p> <p>Saya terbuka terhadap peluang kerja di mana saya dapat berkontribusi, belajar, dan berkembang. \nJika Anda memiliki peluang bagus yang sesuai dengan keahlian dan pengalaman saya maka jangan ragu untuk menghubungi saya.</p>",
    "aboutLinkLabel": "Kontak",
    "aboutSkillsHeading": "Kemampuan saya",
    "projectsHeading": "Proyek",
    "projectsSubHeading": "Di sini Anda akan menemukan beberapa proyek pribadi dan klien yang saya buat dengan setiap proyek berisi studi kasusnya sendiri",
    "Thriftshop": "Toko jual barang loakan",
    "thriftshop-description": "Sebuah platform toko barang bekas e-niaga yang memungkinkan pengguna membuka toko online sendiri dan mengunggah produk bekas untuk dijual. \nAda panel toko bagi penjual untuk mengelola produk. \nPembeli dapat melihat dan checkout barang dari berbagai toko.",
    "Case Study": "Studi kasus",
    "contactHeading": "Kontak",
    "contactSubHeading": "Jangan ragu untuk Menghubungi saya dengan mengirimkan formulir di bawah ini dan saya akan menghubungi Anda sesegera mungkin",
    "contactFormField1Label": "Nama",
    "contactFormField1Placeholder": "Masukkan nama Anda",
    "contactFormField2Placeholder": "Masukkan email Anda",
    "contactFormField3Label": "Pesan",
    "contactFormField3Placeholder": "Masukkan pesan Anda",
    "contactFormSubmitButtonLabel": "Kirim",
    "contactFormField2Label": "Surel",
    "tabungan-wisata-description": "Proyek ini merupakan website dinamis dan responsif untuk travel agency study tour, dengan halaman depan yang menarik menampilkan keunggulan jasanya. Dilengkapi halaman daftar tour lengkap dengan fitur filter berdasarkan harga, durasi, dan lainnya, serta halaman 'About Us' dan 'Terms of Service'. Dibangun dengan desain modern dan user-friendly, website ini menjanjikan pengalaman optimal di perangkat desktop maupun mobile dengan memanfaatkan teknologi terkini pengembangan web untuk performa dan fungsionalitas maksimal.",
    "tabungan-wisata-admin-description": "Proyek ini merupakan sebuah admin dashboard yang komprehensif untuk Travel Agency yang memungkinkan manajemen operasional secara efisien. Fitur utamanya mencakup pengelolaan tur dan acara, manajemen pelanggan, pemrosesan transaksi, analisis dan pelaporan, serta manajemen konten. Salah satu fitur unggulan adalah kemampuan untuk melihat admin mana yang sedang online secara real-time menggunakan teknologi Web Socket. Dashboard ini dibangun dengan mempertimbangkan keamanan dan skalabilitas, serta menggunakan praktik terbaik dalam pengembangan web modern.",
    "tabungan-wisata-dashboard-description": "Proyek ini merupakan sebuah user dashboard untuk travel agency. Fitur utamanya meliputi kemampuan melakukan top up saldo melalui pembayaran terintegrasi dengan payment gateway Midtrans untuk kemudahan dan keamanan bertransaksi, memonitor saldo dan riwayat transaksi dengan antarmuka intuitif dan responsif, serta sistem notifikasi real-time agar selalu terhubung dengan informasi terbaru. Selain itu, proyek ini menggunakan teknologi Progressive Web App (PWA)."
  },
  "layout": {
    "footerText": "© Hak Cipta 2023. Dibuat oleh Farhan Aziz"
  },
  "CSProject": {
    "mainDescription": "Halaman ini berisi studi kasus proyek {project} yang mencakup Ikhtisar Proyek, Alat yang Digunakan, dan Tautan Langsung ke produk resmi.",
    "projectLinkLabel": "Tautan Proyek",
    "overviewHeading": "Ulasan Proyek",
    "toolsHeading": "Alat yang digunakan",
    "liveHeading": "Lihat Langsung",
    "sourceCodeHeading": "Kode sumber",
    "thriftshop-overview": "<p>Toko Barang Bekas adalah platform e-niaga yang memungkinkan pengguna membuat toko online sendiri dan menjual barang bekas seperti toko barang bekas. \nPengguna dapat mendaftarkan akun, membuat profil toko, dan mengunggah produknya.</p> <p>Fitur utama:</p> <ul> <li>Pendaftaran akun pengguna</li> <li>Pembuatan profil toko</li> <li>Panel toko untuk mengelola produk</li> <li>Formulir unggah produk dengan detail deskripsi, foto, kategori, stok, dan harga</li> <li>Sistem pencarian dan pemfilteran produk</li> <li>Keranjang belanja</li> <li>Panel toko memungkinkan penjual mengelola produk mereka dengan menambahkan stok dan memperbarui detail.</li> <li>Pembeli dapat menelusuri dan mencari produk dari berbagai toko dan menambahkannya ke belanja \nkeranjang.</li> </ul>",
    "tabungan-wisata-dashboard-overview": "<p>Projek ini merupakan sebuah user dashboard yang komprehensif untuk sebuah travel agency. Dashboard ini menawarkan berbagai fitur yang dirancang untuk meningkatkan pengalaman pengguna dan memberikan kontrol yang lebih besar atas aktivitas perjalanan mereka.</p>  <p>Fitur Utama:</p>  <ul> <li><strong>Top Up Terintegrasi</strong>: Pengguna dapat dengan mudah mengisi ulang saldo akun mereka melalui metode pembayaran yang terintegrasi dengan payment gateway Midtrans. Ini memberikan pengalaman yang lancar dan aman dalam melakukan transaksi keuangan.</li>  <li><strong>Pengelolaan Saldo dan Transaksi</strong>: Dashboard menyediakan visibilitas yang jelas atas saldo akun dan riwayat transaksi pengguna. Pengguna dapat dengan mudah melacak pengeluaran dan memantau progress saldo mereka.</li>  <li><strong>Notifikasi Real-time</strong>: Dengan mengintegrasikan teknologi WebSocket, dashboard ini memungkinkan pengguna menerima notifikasi real-time tentang aktivitas akun mereka, pembaruan perjalanan, dan informasi penting lainnya.</li>  <li><strong>Progressive Web App</strong>: Aplikasi ini dibangun dengan menggunakan konsep Progressive Web App (PWA), yang memungkinkannya untuk berfungsi seperti aplikasi native pada perangkat seluler, memberikan pengalaman yang lebih responsif dan imersif.</li> </ul> <p>Dalam proses pengembangan projek ini, terdapat beberapa tantangan yang harus dihadapi dan pelajaran berharga yang diperoleh:</p>  <ul> <li><strong>Integrasi WebSocket</strong>: Mengimplementasikan WebSocket untuk mendukung notifikasi real-time membutuhkan pemahaman yang mendalam tentang komunikasi dua arah antara server dan klien, serta pengelolaan koneksi yang efisien.  <li><strong>Keamanan Transaksi</strong>: Memastikan keamanan transaksi keuangan adalah prioritas utama. Implementasi enkripsi data, verifikasi pembayaran, dan penanganan kesalahan yang tepat dipelajari dan diterapkan untuk menjaga integritas dan keamanan sistem.  <li><strong>Autentikasi dan Otorisasi</strong>: Menerapkan mekanisme autentikasi dan otorisasi yang aman adalah kunci untuk melindungi data pengguna dan mencegah akses yang tidak sah. Teknik-teknik seperti enkripsi kata sandi, pengelolaan sesi, dan otorisasi berbasis peran dipelajari dan diimplementasikan dengan baik.  <li><strong>Presisi dan Akurasi Data</strong>: Dalam konteks transaksi keuangan dan pengelolaan perjalanan, akurasi data sangat penting. Pembelajaran tentang penanganan data yang tepat, validasi input, dan pengelolaan kesalahan dilakukan untuk memastikan integritas data. </ul>",
    "tabungan-wisata-admin-overview": "<p>Proyek ini merupakan pengembangan sebuah admin dashboard yang komprehensif untuk travel agency. Dashboard ini dirancang untuk memfasilitasi pengelolaan yang efisien dan terpusat atas berbagai aspek bisnis travel agency, termasuk manajemen tur dan acara, manajemen pelanggan, manajemen transaksi, analisis, pelaporan, dan manajemen konten. Dengan fitur-fitur yang lengkap dan terintegrasi, admin dashboard ini menawarkan solusi yang powerful untuk mengoptimalkan operasional dan memberikan pengalaman pengguna yang optimal bagi pihak manajemen travel agency.</p>  <p>Poin-poin yang dapat dijelaskan:</p>  <ol> <li><strong>Manajemen Tur dan Acara</strong>:</li> <ul>    <li>Fitur untuk membuat, mengatur, dan memperbarui detail tur dan acara yang ditawarkan oleh travel agency.</li>    <li>Kemampuan untuk mengatur jadwal, harga, kuota peserta, dan informasi lainnya terkait tur dan acara.</li>    </ul>  <li><strong>Manajemen Pelanggan</strong>:</li> <ul>    <li>Sistem untuk mengelola data pelanggan, termasuk profil, dan riwayat pemesanan.</li>    </ul>  <li><strong>Manajemen Transaksi</strong>:</li> <ul>    <li>Pengelolaan pemesanan dan transaksi pembelian tiket atau paket tur secara terpusat.</li>    <li>Kemampuan untuk melacak status pemesanan dan melakukan proses pembayaran.</li>    <li>Integrasi dengan gateway pembayaran pihak ketiga untuk memfasilitasi transaksi yang aman.</li>    </ul>  <li><strong>Analisis dan Pelaporan</strong>:</li> <ul>    <li>Dashboard analitik yang menampilkan metrik kinerja bisnis yang penting dalam bentuk visualisasi data yang informatif.</li>    <li>Kemampuan untuk menghasilkan laporan penjualan, pendapatan, dan statistik lainnya.</li>    <li>Fitur untuk mengekspor data dalam berbagai format untuk analisis lebih lanjut.</li>    </ul>  <li><strong>Manajemen Konten</strong>:</li> <ul>    <li>Sistem manajemen konten terintegrasi untuk mengelola informasi website, dan materi promosi travel agency.</li>    <li>Kemampuan untuk membuat, mengedit, dan mempublikasikan konten secara dinamis.</li>    </ul>  <li><strong>Role-Based Access Control (RBAC)</strong>:</li> <ul>    <li>Implementasi sistem otorisasi dan kontrol akses yang ketat berdasarkan peran dan izin pengguna.</li>    <li>Kemampuan untuk mendefinisikan peran dengan tingkat akses yang berbeda-beda sesuai dengan kebutuhan organisasi.</li>    <li>Memastikan keamanan data dan privasi informasi dengan membatasi akses hanya kepada pengguna yang berwenang.</li>    </ul>  <li><strong>API Endpoint yang Fleksibel</strong>:</li> <ul>    <li>Pengembangan API endpoint yang memungkinkan integrasi dengan sistem eksternal atau aplikasi pihak ketiga.</li>    <li>Kemampuan untuk melakukan filtering, sorting, dan paginasi data melalui API endpoint.</li>    <li>Dokumentasi API yang komprehensif untuk memfasilitasi pengembangan dan integrasi lebih lanjut.</li>    </ul>    </ol>",
    "tabungan-wisata-overview": "<p>Proyek ini adalah sebuah web yang dirancang untuk halaman depan sebuah study tour travel agency. Website ini memiliki desain yang menarik dan responsif, memberikan pengalaman pengguna yang optimal di berbagai perangkat.</p>  <p>Fitur-fitur utama dari proyek ini meliputi:</p>  <ul> <li><strong>Halaman Depan Interaktif</strong>: Halaman depan yang dinamis dan responsif, dengan tampilan yang menarik dan memberikan informasi penting tentang perusahaan travel agency. Halaman ini dirancang untuk membuat kesan yang baik pada pengunjung dan mendorong mereka untuk menjelajahi lebih lanjut. </li>  <li><strong>Halaman Daftar Tur</strong>: Halaman ini menampilkan daftar lengkap tur yang ditawarkan oleh perusahaan travel agency. Pengguna dapat dengan mudah menelusuri dan menemukan tur yang sesuai dengan minat mereka menggunakan fitur filter yang canggih, seperti harga, durasi tur, lokasi, dan lainnya. </li>  <li><strong>Responsif dan Ramah Seluler</strong>: Proyek ini dibangun dengan prinsip responsive web design, memastikan pengalaman pengguna yang optimal di berbagai perangkat, termasuk desktop, tablet, dan perangkat seluler. </li>  <li><strong>Kinerja Tinggi</strong>: Website ini dirancang dengan mempertimbangkan kinerja, memastikan waktu muat yang cepat. </li> </ul>"
  }
}
