{
  "Home": "家",
  "About": "について",
  "Projects": "プロジェクト",
  "Contact": "接触",
  "home": {
    "heroHeading": "こんにちは、ファルハンです",
    "heroDescription": "堅牢なフロントエンド設計と強力なバックエンドをシームレスに統合することで、包括的な Web ソリューションを作成するフルスタック開発者",
    "heroLinkLabel": "プロジェクト",
    "aboutHeading": "私について",
    "aboutSubHeading": "ここでは、私についての詳細、私の仕事、主にプログラミングとテクノロジーに関する現在のスキルについて説明します。",
    "aboutDescriptionHeading": "私を知ってください！",
    "aboutDescription": "<p>私は、最初から最後まで完全な Web アプリケーションを構築することに熟練したフルスタック Web 開発者です。\n私は、Web アプリケーションのフロントエンド部分とバックエンド部分の両方を開発し、クライアント側とサーバー側の両方のテクノロジを使用します。</p> <p>フロントエンドでは、HTML を使用して応答性が高く直感的なユーザー インターフェイスを作成します。 \n、CSS、React などの JavaScript フレームワーク。\nユーザー エクスペリエンスを強化し、モバイル デバイスのブラウザ間の互換性と応答性を確保する機能を実装します。</p> <p>バックエンドでは、NestJS を使用して、機能、セキュリティ、データのためのサーバー、API、データベース コンポーネントを開発します。 \nMySQL や PostgreSQL などのデータベース。\n私は RESTful API を通じてフロントエンド要素をバックエンドと統合しています。</p> <p>貢献し、学び、成長できる仕事の機会を歓迎します。\n私のスキルや経験に合った良い機会があれば、遠慮せずにご連絡ください。</p>",
    "aboutLinkLabel": "接触",
    "aboutSkillsHeading": "私のスキル",
    "projectsHeading": "プロジェクト",
    "projectsSubHeading": "ここでは、私が作成した個人プロジェクトとクライアント プロジェクトの一部を紹介します。各プロジェクトには独自のケーススタディが含まれています。",
    "Thriftshop": "リサイクルショップ",
    "thriftshop-description": "ユーザーが独自のオンライン ストアを開設し、中古品をアップロードして販売できるプラットフォームの e コマース リサイクル ショップ。\n販売者が商品を管理するためのストアパネルがあります。\nバイヤーはさまざまなストアの商品を閲覧してチェックアウトできます。",
    "Case Study": "ケーススタディ",
    "contactHeading": "接触",
    "contactSubHeading": "以下のフォームを送信して、お気軽にお問い合わせください。できるだけ早くご連絡いたします。",
    "contactFormField1Label": "名前",
    "contactFormField1Placeholder": "あなたの名前を入力してください",
    "contactFormField2Placeholder": "メールアドレスを入力",
    "contactFormField3Label": "メッセージ",
    "contactFormField3Placeholder": "メッセージを入力してください",
    "contactFormSubmitButtonLabel": "送信",
    "contactFormField2Label": "Eメール",
    "tabungan-wisata-description": "このプロジェクトは、スタディ ツアー旅行代理店向けのダイナミックで応答性の高い Web サイトであり、サービスの利点を紹介する魅力的なホームページを特徴としています。\nこれには、価格、期間、その他の条件に基づくフィルタリング オプションを備えた包括的なツアー リスト ページ、および「会社概要」ページと「利用規約」ページが含まれています。\nこの Web サイトはモダンでユーザーフレンドリーなデザインで構築されており、最新の Web 開発テクノロジーを活用して最大限のパフォーマンスと機能を実現し、デスクトップとモバイルデバイスの両方で最適なエクスペリエンスを約束します。",
    "tabungan-wisata-admin-description": "このプロジェクトは、効率的な業務管理を可能にする旅行代理店向けの包括的な管理ダッシュボードです。\nその主な機能には、ツアーとイベントの管理、顧客管理、トランザクション処理、分析とレポート、コンテンツ管理が含まれます。\nその際立った機能の 1 つは、WebSocket テクノロジーを使用してどの管理者がオンラインであるかをリアルタイムで確認できることです。\nこのダッシュボードは、セキュリティとスケーラビリティを念頭に置いて構築されており、最新の Web 開発のベスト プラクティスに従っています。",
    "tabungan-wisata-dashboard-description": "このプロジェクトは旅行代理店のユーザー ダッシュボードです。\nその主な機能には、取引を容易かつ安全にするための Midtrans 支払いゲートウェイとの統合支払いを通じて残高を補充する機能、直観的で応答性の高いインターフェイスによる残高と取引履歴の監視、および接続を維持するためのリアルタイム通知システムが含まれます。\n最新情報。\nさらに、このプロジェクトでは Progressive Web App (PWA) テクノロジーを利用しています。"
  },
  "layout": {
    "footerText": "© Copyright 2023. ファルハン・アジズ作"
  },
  "CSProject": {
    "mainDescription": "このページには、プロジェクトの概要、使用したツール、公式製品へのライブ リンクを含む、{project} プロジェクトのケース スタディが含まれています。",
    "projectLinkLabel": "プロジェクトリンク",
    "overviewHeading": "プロジェクト概要",
    "toolsHeading": "使用したツール",
    "liveHeading": "ライブを見る",
    "sourceCodeHeading": "ソースコード",
    "thriftshop-overview": "<p>リサイクル ショップは、ユーザーが独自のオンライン ストアを作成し、リサイクル ショップのように中古品を販売できる電子商取引プラットフォームです。\nユーザーはアカウントを登録し、ストア プロフィールを作成し、商品をアップロードできます。</p> <p>主な機能:</p> <ul> <li>ユーザー アカウントの登録</li> <li>ストア プロフィールの作成</li> <li>製品を管理するためのストア パネル</li> <li>説明の詳細、写真、カテゴリ、在庫、価格を含む製品アップロード フォーム</li> <li>製品の検索およびフィルタリング システム</li> <li>ショッピング カート</li> <li>ストア パネルを使用すると、販売者は在庫を追加したり詳細を更新したりして製品を管理できます。</li> <li>購入者はさまざまなストアから製品を参照および検索し、ショッピングに追加できます。\nカート。</li> </ul>",
    "tabungan-wisata-dashboard-overview": "<p>このプロジェクトは、旅行代理店のための包括的なユーザーダッシュボードです。このダッシュボードは、ユーザーエクスペリエンスを向上させ、旅行活動に対するより大きな制御を提供することを目的とした様々な機能を提供しています。</p> <p>主な機能:</p> <ul> <li><strong>統合された残高チャージ</strong>: ユーザーは、Midtransの決済ゲートウェイと統合された決済方法を通じて、簡単にアカウントの残高をチャージできます。これにより、金融取引の経験がスムーズで安全になります。</li> <li><strong>残高と取引の管理</strong>: ダッシュボードは、アカウントの残高とユーザーの取引履歴を明確に表示します。ユーザーは支出を簡単に追跡し、残高の進捗を監視できます。</li> <li><strong>リアルタイムの通知</strong>: WebSocketテクノロジーを統合することで、このダッシュボードはユーザーがアカウント活動、旅行の更新、その他の重要な情報についてリアルタイムで通知を受信できるようになります。</li> <li><strong>プログレッシブウェブアプリ</strong>: このアプリケーションは、プログレッシブウェブアプリ(PWA)の概念を使用して構築されており、モバイルデバイスでネイティブアプリのように機能し、よりレスポンシブで没入感のある体験を提供します。</li> </ul> <p>このプロジェクトの開発プロセスでは、克服しなければならない幾つかの課題があり、貴重な教訓を得ました。</p> <ul> <li><strong>WebSocketの統合</strong>: リアルタイムの通知をサポートするためにWebSocketを実装するには、サーバーとクライアント間の双方向通信の深い理解と、効率的な接続管理が必要でした。</li> <li><strong>取引のセキュリティ</strong>: 金融取引のセキュリティを確保することが最優先事項でした。データの暗号化、決済の検証、適切なエラー処理の実装を学び、システムの完全性とセキュリティを維持しました。</li> <li><strong>認証と認可</strong>: 安全な認証と認可メカニズムを実装することは、ユーザーデータを保護し、不正アクセスを防ぐための鍵となりました。パスワードの暗号化、セッション管理、役割ベースの認可などの手法を学び、適切に実装しました。</li> <li><strong>データの精度と正確性</strong>: 金融取引と旅行管理のコンテキストでは、データの正確性が非常に重要です。適切なデータ処理、入力検証、エラー管理を学び、データの完全性を確保しました。</li> </ul>",
    "tabungan-wisata-admin-overview": "<p>このプロジェクトは、旅行代理店向けの包括的な管理ダッシュボードの開発です。このダッシュボードは、旅行代理店ビジネスのさまざまな側面、ツアーおよびイベントの管理、顧客管理、取引管理、分析、レポート作成、およびコンテンツ管理を効率的かつ集中的に管理することを目的としています。包括的で統合された機能を備えたこの管理ダッシュボードは、オペレーションの最適化を図り、旅行代理店の管理陣に最適なユーザーエクスペリエンスを提供する強力なソリューションを提供します。</p>  <p>説明できるポイント:</p>  <ol>   <li><strong>ツアーとイベントの管理</strong>:</li>   <ul>     <li>旅行代理店が提供するツアーやイベントの詳細を作成、整理、更新するための機能。</li>     <li>ツアーやイベントに関連するスケジュール、価格、参加者クォータ、およびその他の情報を設定する機能。</li>   </ul>    <li><strong>顧客管理</strong>:</li>   <ul>     <li>顧客データ、プロフィール、予約履歴などを管理するシステム。</li>   </ul>    <li><strong>取引管理</strong>:</li>   <ul>     <li>予約とチケットまたはツアーパッケージの購入を中央集権的に管理する機能。</li>     <li>予約の状態を追跡し、支払いプロセスを行う機能。</li>     <li>セキュアな取引を促進するための第三者支払いゲートウェイとの統合。</li>   </ul>    <li><strong>分析とレポート作成</strong>:</li>   <ul>     <li>ビジネスの重要なパフォーマンスメトリクスを示す分析ダッシュボード。</li>     <li>売上、収益などの統計レポートを生成する機能。</li>     <li>さまざまな形式でデータをエクスポートする機能。</li>   </ul>    <li><strong>コンテンツ管理</strong>:</li>   <ul>     <li>ウェブサイト情報や旅行代理店のプロモーション資料を管理する統合コンテンツ管理システム。</li>     <li>コンテンツをダイナミックに作成、編集、公開する機能。</li>   </ul>    <li><strong>ロールベースのアクセス制御（RBAC）</strong>:</li>   <ul>     <li>ユーザーの役割と権限に基づいた厳密な認可とアクセス制御システムの実装。</",
    "tabungan-wisata-overview": "<p>このプロジェクトは、スタディツアー旅行代理店のホームページ向けに設計されたウェブサイトです。ウェブサイトは魅力的でレスポンシブなデザインを備えており、さまざまなデバイスで最適なユーザーエクスペリエンスを提供します。</p>  <p>このプロジェクトの主な機能には、次のものがあります:</p>  <ul>   <li><strong>インタラクティブなホームページ</strong>: 動的でレスポンシブなホームページで、魅力的なレイアウトと旅行代理店の重要な情報が提供されます。このページは訪問者に良い印象を与え、さらに探索するよう促すために設計されています。   </li>    <li><strong>ツアーリストページ</strong>: このページでは、旅行代理店が提供するツアーの包括的なリストが表示されます。ユーザーは、価格、ツアーの所要時間、場所などの高度なフィルタリング機能を使用して、自分の興味に合ったツアーを簡単に見つけることができます。   </li>    <li><strong>レスポンシブでモバイルフレンドリー</strong>: このプロジェクトは、レスポンシブウェブデザインの原則に基づいて構築されており、デスクトップ、タブレット、モバイルデバイスを含むさまざまなデバイスで最適なユーザーエクスペリエンスを保証します。   </li>    <li><strong>高性能</strong>: ウェブサイトはパフォーマンスを考慮して設計されており、高速な読み込み時間を保証しています。   </li> </ul>"
  }
}
